
#define Tact_Value 50 /* ПЮГЛЕП РЮЙРЮ Б ЛХККХЯЕЙСМДЮУ */
    
#define C_0 /* р0_1 */                       0  
#define C_1 /* ндмю_яейсмдю */               2  
#define C_2 /* дбе_яейсмдш */             2*C_1
#define C_3 /* рпх_яейсмдш */             3*C_1
#define C_4 /* оърэ_яейсмд */             5*C_1
#define C_5 /* деяърэ_яейсмд */          10*C_1
#define C_6 /* дбюджюрэ_яейсмд */        20*C_1
#define C_7 /* рюилюср_мю_япюаюршбюмхе_гюр_бюй */			10*C_1
#define C_8 /* рюилюср_мю_япюаюршбюмхе_яюосмю */           	C_5
#define C_9 /* рюилюср_мю_япюаюршбюмхе_сярп_окюб_осяйю */   3*C_1
#define C_10 /* рюилюср_мю_япюаюршбюмхе_бюй_мюяняю */ 		3*C_1
#define C_11 /* рюилюср_мю_япюаюршбюмхе_бемрхкърнпю */		C_4
#define C_12 /* рюилюср_мю_япюаюршбюмхе_пец_р */				3*C_1
#define C_13 /* рюилюср_мю_япюаюршбюмхе_пец_сп */			3*C_1
#define C_14 /* рюилюср_мю_япюаюршбюмхе_мюяня_нук */			3*C_1
#define C_15 /* рюилюср_мю_ябъгэ_я_цсх */  C_5
#define C_16 /* ндмю_лхмсрю */          60*C_1
#define C_17 /* дбе_лхмсрш */          2*C_16
#define C_18 /* оърэ_лхмср */          5*60*C_1
#define C_19 /* рпхджюрэ_лхмср */          30*C_16
#define C_20 /* рюилюср_гюдепфйю_мю_нрйювйс */ C_4

#define C_21 /* бйк */                1
#define C_22 /* бшй */               0
#define C_23 /* нрйп */              1
#define C_24 /* гюйп */          	0
#define C_25 /* еярэ */               1
#define C_26 /* мер */                0
#define C_27 /* мнплю */              1
#define C_28 /* бме_мнплш */          0
#define C_29 /* днярнбепмн */                1
#define C_30 /* меднярнбепмн */               0


#define C_31 /* рюилюср_мю_дхюцмнярхйс_пюгпшбю_ябъгх */ 5*C_1

#define C_32 /* р_оПЕДЕКЭМЮЪбАЮЙЕнУКЮФДЕМХЪ */          99.0 

  

#define C_33 /* р_цхярепегхя_бндш_б_аюйе */  1.0
#define C_34 /* р_цхярепегхя_бндш_б_псаюуе */  1.0


enum EN0 {
    C_35,
    C_36,
	C_37,
	C_38,
	C_39,
	C_40,

    C_41,
	C_42,
	C_43,

	C_44,
	C_45,
	
	C_46,
	C_47,
	
	C_48,
    C_49
	

	
};
enum EN1 {
     C_50= C_49 + 1,
     C_51    	,
     C_52			    ,
     C_53			    ,
     C_54    ,
     C_55    ,
	 C_56     ,
	 C_57     ,
	 C_58    ,
	 C_59    ,
     C_60    ,
	 C_61    ,
     C_62     ,
	 C_63     , 
	 C_64 ,
	 C_65    , 
	 C_66,
	 C_67,
	 C_68 ,
	 C_69,   
     C_70 = C_69 
	
 
	
};


enum EN2 {
	C_71 = C_70 + 1,
	C_72,
	C_73,	
	C_74,	
    C_75,
    C_76 = C_75  
  
};

enum EN3 {                    
      C_77 = C_76 + 1,
      C_78,
      C_79,
      C_80,
	  C_81,
	  C_82,
	  C_83,
	  C_84,
	  C_85,
	  C_86,
	  C_87,
	  C_88,
	  C_89,
	  C_90,
	  C_91,
	  C_92,
	  C_93, 				
	  C_94,
	  C_95,
	  C_96,
	  C_97,	  
	  C_98,   
	  C_99,
	  C_100,
	  C_101,
	  C_102,
	  C_103,
	  C_104,
	  C_105,
	  C_106,
	  C_107,
	  C_108,
	  C_109,
	  C_110,
	  C_111,
	  C_112,
	  C_113,
	  C_114,
	  C_115,
	  C_116,
	  C_117,
  	  C_118,
	  C_119,
	  C_120,
	  C_121,
	  C_122,
	  C_123,
	  C_124,
	  C_125,
	  C_126,
	  C_127,
	  C_128,
	  C_129,
	  C_130,
	  C_131,
	  C_132,
	  C_133,
	  C_134,
	  C_135,
      C_136,
	  C_137,
	  C_138,
      C_139,
	  C_140,
	  C_141,
	  C_142,
	  C_143,
	  C_144,
	  C_145,
	  C_146

};


enum EN4 {                    
      C_147 = C_146 + 1,
      C_148,
      C_149,
      C_150,
      C_151
      

      
};
enum EN5 {
C_152 = C_151 + 1,
C_153 = C_152,
C_154,
C_155,

C_156

};



enum EN6 {
     C_157 = C_156 + 1  
  
};