
#define Tact_Value 50 /* ПЮГЛЕП РЮЙРЮ Б ЛХККХЯЕЙСМДЮУ */
    
#define C_0 /* р0_1 */                       0  
#define C_1 /* ндмю_яейсмдю */               10  
#define C_2 /* дбе_яейсмдш */             2*C_1
#define C_3 /* рпх_яейсмдш */             3*C_1
#define C_4 /* рюилюср_мю_днярнбепмнярэ */ C_2
#define C_5 /* оърэ_яейсмд */             5*C_1
#define C_6 /* люйяхлюкэмюъ_дкхрекэмнярэ_нрясрярбхъ_днярнбепмнярх */ C_5

#define C_7 /* деяърэ_яейсмд */          10*C_1
#define C_8 /* дбюджюрэ_яейсмд */        20*C_1
#define C_9 /* рюилюср_мю_япюаюршбюмхе_гюр_бюй */			C_5	
#define C_10 /* рюилюср_мю_япюаюршбюмхе_яюосмю */           	C_3   
#define C_11 /* рюилюср_мю_япюаюршбюмхе_сярп_окюб_осяйю */   3*C_1
#define C_12 /* рюилюср_мю_япюаюршбюмхе_бюй_мюяняю */ 		3*C_1
#define C_13 /* рюилюср_мю_япюаюршбюмхе_бемрхкърнпю */		C_5
#define C_14 /* рюилюср_мю_япюаюршбюмхе_пец_р */				3*C_1
#define C_15 /* рюилюср_мю_япюаюршбюмхе_пец_сп */			3*C_1
#define C_16 /* рюилюср_мю_япюаюршбюмхе_мюяня_нук */			3*C_1
#define C_17 /* рюилюср_мю_ябъгэ_я_цсх */  C_7
#define C_18 /* ндмю_лхмсрю */          60*C_1
#define C_19 /* дбе_лхмсрш */          2*C_18
#define C_20 /* оърэ_лхмср */          5*60*C_1
#define C_21 /* деяърэ_лхмср */			10*C_18
#define C_22 /* рпхджюрэ_лхмср */          30*C_18
#define C_23 /* оърмюджюрэ_лхмср */          15*C_18
#define C_24 /* рюилюср_гюдепфйю_мю_нрйювйс */ C_7

#define C_25 /* бйк */                1
#define C_26 /* бшй */               0
#define C_27 /* нрйп */              1
#define C_28 /* гюйп */          	0
#define C_29 /* еярэ */               1
#define C_30 /* мер */                0
#define C_31 /* мхфе_мнплш */		0
#define C_32 /* мнплю */              1
#define C_33 /* бшье_мнплш */		2
#define C_34 /* бме_мнплш */			0
#define C_35 /* днярнбепмн */                1
#define C_36 /* меднярнбепмн */               0
#define C_37 /* мЕ_ОПНБЕПЪЧРЯЪ */       0  
#define C_38 /* оПНБЕПЪЧРЯЪ */      1

#define C_39 /* рюилюср_мю_дхюцмнярхйс_пюгпшбю_ябъгх */ 5*C_1

#define C_40 /* р_оПЕДЕКЭМЮЪбПСАЮЬЙЕнУКЮФДЕМХЪ */          85.0 
#define C_41 /* р_оПЕДЕКЭМЮЪбАЮЙЕнУКЮФДЕМХЪ */          65.0 

enum EN0 {
    C_42,
    C_43,
	C_44,
	C_45,  
	
	C_46,
	C_47,
	C_48,

    C_49,
	C_50,
	C_51,

	C_52,
	C_53,
	
	C_54,
	C_55, 

		
	C_56,
	C_57,  
    C_58,
	
	
	C_59,
	C_60,
	C_61
	

	
};
enum EN1 {
     C_62= C_58 + 1,
     C_63    	,
     C_64			    ,
     C_65			    ,
     C_66    ,
     C_67    ,
 
 	 C_68     ,
	 C_69     ,
	 C_70    ,
	 C_71    ,
     C_72    ,
	 C_73    ,
     C_74     ,
	 C_75     , 
	 C_76 ,
	 C_77    , 
	 C_78,
	 C_79, 
	 C_80 ,
   
     C_81 = C_80 
	
 
	
};


enum EN2 {
	C_82 = C_81 + 1,
	C_83,
	C_84,	
	C_85,	
    C_86,
    C_87 = C_86  
  
};

enum EN3 {                    
      C_88 = C_87 + 1,
      C_89,
      C_90,
      C_91,
	  C_92,
	  C_93,
	  C_94,
	  C_95,
	  C_96,
	  C_97,
	  C_98,
	  C_99,
	  C_100,
	  C_101,
	  C_102,
	  C_103,
	  C_104, 				
	  C_105,
	  C_106,
	  C_107,
	  C_108,	  
	  C_109,   
	  C_110,  
	  C_111,
	  

		C_112, 
		C_113,	
		C_114,				
		C_115,					
		

	  C_116, 
	  C_117,	
	  C_118,	
	  C_119,
	  C_120,
	  C_121,
	  C_122,
	  C_123,
	  C_124,
	  C_125,
	  C_126,
	  C_127,
	  C_128,
	  C_129,
	  C_130,
	  C_131,
	  C_132,
	  C_133,  
	  C_134,  
	  C_135,
	  C_136,
	  C_137,
	  C_138,
  	  C_139,
	  C_140,
	  C_141,
	  C_142,
	  C_143,
	  C_144,
	  C_145,
	  C_146,
	  C_147,
	  C_148,
	  C_149,
	  C_150,
	  C_151,
	  C_152,
	  C_153,
	  C_154,
	  C_155,
	  C_156,
      C_157,
	  C_158,
	  C_159,
      C_160,
	  C_161,
	  C_162,
	  C_163,
	  C_164, 
	  C_165,	
	  C_166,
	  C_167,
	  C_168,  
	  C_169,
	  C_170,
	  C_171,
	  C_172,
	  C_173,
	  C_174,
	  C_175,
	  C_176,
	  C_177,
	  C_178,   
	  C_179,		
		C_180,
		C_181,
		C_182,		
		C_183,		
		C_184,	
		C_185,	
		C_186,		
		C_187,		
		C_188,	
		C_189,	
	  C_190,
	  C_191

};


enum EN4 {                    
      C_192 = C_191 + 1,
      C_193,
      C_194,
      C_195,
      C_196
      

      
};
enum EN5 {
C_197 = C_196 + 1,
C_198 = C_197,
C_199,
C_200,	
C_201,		
C_202,	
C_203,
C_204,

C_205,  
C_206, 

C_207,
C_208,
C_209,
C_210,
C_211,

C_212

};

enum EN6 {
     C_213 = C_212 + 1  
  
};