
#define Tact_Value 50 /* ПЮГЛЕП РЮЙРЮ Б ЛХККХЯЕЙСМДЮУ */
    

#define C_0 /* бйк */                1
#define C_1 /* бшйк */               0
#define C_2 /* лхмхлюкэмне_гюдюмхе_R_йюперйх */            0.0    
#define C_3 /* люйяхлюкэмне_гюдюмхе_R_йюперйх */        200.0    

#define C_4 /* лхмхлюкэмне_гюдюмхе_W_сЦКНБНИяЙНПНЯРХ */            0.0    
#define C_5 /* люйяхлюкэмне_гюдюмхе_W_сЦКНБНИяЙНПНЯРХ */        200.0     


#define C_6 /* R_он_слнквюмхч */ 0.0
#define C_7 /* W_он_слнквюмхч */ 0.0
#define C_8 /* R_то_он_слнквюмхч */ 0.0
#define C_9 /* то_W_он_слнквюмхч */ 0.0

#define C_10 /* рюилюср_бнгд_ондсьйх */ 10
#define C_11 /* рюилюср_йкюоюмнб */ 10


enum EN0 {
C_12,
C_13,
C_14,
C_15,
C_16,
C_17,
C_18,
C_19,
C_20,
C_21,
C_22,
C_23,
C_24,
C_25,
C_26,
C_27,
C_28,
C_29,
C_30,
C_31,
C_32,

C_33

};

enum EN1 {
	C_34 = C_33 + 1, 
	C_35,  		
	C_36,
	C_37,
	C_38,
	C_39,
	C_40,
	C_41,
	C_42,
	C_43,
	C_44,
	C_45,
	C_46,
	C_47,
	C_48,
	C_49,
	C_50,
	C_51,
	C_52,
	C_53,
	C_54,
	C_55,
	C_56,
	C_57,
	C_58,
	C_59,
	C_60,
	C_61,
	C_62,
	C_63,
	C_64,
	C_65,
	C_66,
	C_67,
	C_68,
	C_69,
	C_70,
	C_71 
  
 };
 
 
 
 enum EN2 {
	C_72,
	C_73,
	C_74
 
 };
 
 enum EN3 {
	C_75,
	C_76,
	C_77

};