
#define Tact_Value 50 /* ПЮГЛЕП РЮЙРЮ Б ЛХККХЯЕЙСМДЮУ */
    
#define C_0 /* ндмю_яейсмдю */               10  
#define C_1 /* дбе_яейсмдш */             2*C_0
#define C_2 /* рпх_яейсмдш */             3*C_0
#define C_3 /* оърэ_яейсмд */             5*C_0
#define C_4 /* деяърэ_яейсмд */          10*C_0
#define C_5 /* дбюджюрэ_яейсмд */        20*C_0
#define C_6 /* рпхджюрэ_яейсмд */        30*C_0
#define C_7 /* ндмю_лхмсрю */            60*C_0
#define C_8 /* дбе_лхмсрш */             2*C_7
#define C_9 /* оърэ_лхмср */             5*60*C_0
#define C_10 /* деяърэ_лхмср */			 10*C_7
#define C_11 /* оърмюджюрэ_лхмср */       15*C_7
#define C_12 /* рпхджюрэ_лхмср */         30*C_7

#define C_13 /* рюилюср_бнгд_ондсьйх */		C_2
#define C_14 /* рюилюср_мюяняю_бюйсслмнцн */	C_5
#define C_15 /* рюилюср_гюфхлю_дхяйю */		C_5
#define C_16 /* рюилюср_пюгфхлю_дхяйю */		C_5

#define C_17 /* рюилюср_мю_япюаюршбюмхе_йкюоюмю_йюперйх */          	C_2   
#define C_18 /* рюилюср_мю_япюаюршбюмхе_йкюоюмю_ьохмдекъ_д */       	C_2   

#define C_19 /* рюилюср_мю_ябъгэ_я_цхн */  C_4

#define C_20 /* бйк */                1
#define C_21 /* бшй */               0
#define C_22 /* бшйк */               0
#define C_23 /* нрйп */              1
#define C_24 /* гюйп */          	0
#define C_25 /* еярэ */               1
#define C_26 /* мер */                0
#define C_27 /* мх_дю_мх_мер */       2


#define C_28 /* лхмхлюкэмне_гюдюмхе_R_йюперйх */            0.0    
#define C_29 /* люйяхлюкэмне_гюдюмхе_R_йюперйх */        200.0    

#define C_30 /* лхмхлюкэмне_гюдюмхе_W_опедлермнцн_ярнкхйю */            0.0    
#define C_31 /* люйяхлюкэмне_гюдюмхе_W_опедлермнцн_ярнкхйю */        200.0     

enum EN0 {
    C_32 = 1,
    C_33,
    C_34        ,
    C_35,  
	C_36       
       
};

enum EN1 {
    C_37 = C_36,
    C_38,  
	C_39 , 
	C_40,
	C_41,
	C_42,
	C_43,
   	C_44,
	C_45,
	C_46,
	C_47,
	C_48,
	C_49,  
	C_50,
	C_51,  
	C_52,
	
	C_53,
	C_54,
	C_55,
	C_56,


	C_57,
    C_58,	
	C_59	
	
	
	
};

enum EN2 {
	
	C_60 = 0,
	C_61,
	C_62,
	
	C_63,
	C_64,
	C_65,
	C_66,
	C_67,

	
	C_68,
	C_69,
	C_70,
	C_71,
	C_72,
	C_73,
	C_74,
	
	
	C_75,
	C_76,
	C_77,
	C_78,
	
	C_79,
	C_80,
	C_81,
	C_82,
	C_83,
	C_84,
	C_85,
	C_86,
	C_87,
	C_88 
 
};	


enum EN3 {
	C_89 = C_88 + 1,
	C_90,
	C_91 = C_90 	
 	
};

enum EN4 {
	C_92 = C_91 + 1,
	C_93

};

enum EN5 {                    
   
	
	C_94 = C_93 +1



};	


enum EN6 { 
	C_95 = C_94 + 1,
	C_96

};
enum EN7 {
    C_97 = C_96 + 1,
	C_98,
	C_99	 
	 
	 
	 
};